// Напишите программу, которая будет преобразовывать десятичное число в двоичное.
// Вариант на Python
// numDecimal = int(input('Input a decimal number to binarize it: '))
// numDivisor = 2
// resultArray = []
// while (numDecimal >= numDivisor):
//     numRemainder = numDecimal - (numDivisor * int(numDecimal / numDivisor))
//     numDecimal = int(numDecimal / numDivisor)
//     resultArray.insert(0, numRemainder)
// if numDecimal == 1:
//     resultArray.insert(0, 1)
// print(resultArray)